{
  "architectures": [
    "Mistral3ForConditionalGeneration"
  ],
  "dtype": "bfloat16",
  "image_token_index": 10,
  "model_type": "mistral3",
  "multimodal_projector_bias": false,
  "projector_hidden_act": "gelu",
  "quantization_config": {
    "config_groups": {
      "group_0": {
        "format": "pack-quantized",
        "input_activations": null,
        "output_activations": null,
        "targets": [
          "Linear"
        ],
        "weights": {
          "actorder": null,
          "block_structure": null,
          "dynamic": false,
          "group_size": 32,
          "num_bits": 4,
          "observer": "mse",
          "observer_kwargs": {},
          "scale_dtype": null,
          "strategy": "group",
          "symmetric": true,
          "type": "int",
          "zp_dtype": null
        }
      }
    },
    "format": "pack-quantized",
    "global_compression_ratio": null,
    "ignore": [
      "model.vision_tower.transformer.layers.0.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.0.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.0.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.0.attention.k_proj",
      "model.vision_tower.transformer.layers.0.attention.v_proj",
      "model.vision_tower.transformer.layers.0.attention.q_proj",
      "model.vision_tower.transformer.layers.0.attention.o_proj",
      "model.vision_tower.transformer.layers.1.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.1.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.1.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.1.attention.k_proj",
      "model.vision_tower.transformer.layers.1.attention.v_proj",
      "model.vision_tower.transformer.layers.1.attention.q_proj",
      "model.vision_tower.transformer.layers.1.attention.o_proj",
      "model.vision_tower.transformer.layers.2.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.2.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.2.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.2.attention.k_proj",
      "model.vision_tower.transformer.layers.2.attention.v_proj",
      "model.vision_tower.transformer.layers.2.attention.q_proj",
      "model.vision_tower.transformer.layers.2.attention.o_proj",
      "model.vision_tower.transformer.layers.3.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.3.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.3.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.3.attention.k_proj",
      "model.vision_tower.transformer.layers.3.attention.v_proj",
      "model.vision_tower.transformer.layers.3.attention.q_proj",
      "model.vision_tower.transformer.layers.3.attention.o_proj",
      "model.vision_tower.transformer.layers.4.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.4.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.4.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.4.attention.k_proj",
      "model.vision_tower.transformer.layers.4.attention.v_proj",
      "model.vision_tower.transformer.layers.4.attention.q_proj",
      "model.vision_tower.transformer.layers.4.attention.o_proj",
      "model.vision_tower.transformer.layers.5.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.5.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.5.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.5.attention.k_proj",
      "model.vision_tower.transformer.layers.5.attention.v_proj",
      "model.vision_tower.transformer.layers.5.attention.q_proj",
      "model.vision_tower.transformer.layers.5.attention.o_proj",
      "model.vision_tower.transformer.layers.6.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.6.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.6.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.6.attention.k_proj",
      "model.vision_tower.transformer.layers.6.attention.v_proj",
      "model.vision_tower.transformer.layers.6.attention.q_proj",
      "model.vision_tower.transformer.layers.6.attention.o_proj",
      "model.vision_tower.transformer.layers.7.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.7.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.7.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.7.attention.k_proj",
      "model.vision_tower.transformer.layers.7.attention.v_proj",
      "model.vision_tower.transformer.layers.7.attention.q_proj",
      "model.vision_tower.transformer.layers.7.attention.o_proj",
      "model.vision_tower.transformer.layers.8.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.8.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.8.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.8.attention.k_proj",
      "model.vision_tower.transformer.layers.8.attention.v_proj",
      "model.vision_tower.transformer.layers.8.attention.q_proj",
      "model.vision_tower.transformer.layers.8.attention.o_proj",
      "model.vision_tower.transformer.layers.9.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.9.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.9.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.9.attention.k_proj",
      "model.vision_tower.transformer.layers.9.attention.v_proj",
      "model.vision_tower.transformer.layers.9.attention.q_proj",
      "model.vision_tower.transformer.layers.9.attention.o_proj",
      "model.vision_tower.transformer.layers.10.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.10.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.10.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.10.attention.k_proj",
      "model.vision_tower.transformer.layers.10.attention.v_proj",
      "model.vision_tower.transformer.layers.10.attention.q_proj",
      "model.vision_tower.transformer.layers.10.attention.o_proj",
      "model.vision_tower.transformer.layers.11.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.11.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.11.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.11.attention.k_proj",
      "model.vision_tower.transformer.layers.11.attention.v_proj",
      "model.vision_tower.transformer.layers.11.attention.q_proj",
      "model.vision_tower.transformer.layers.11.attention.o_proj",
      "model.vision_tower.transformer.layers.12.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.12.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.12.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.12.attention.k_proj",
      "model.vision_tower.transformer.layers.12.attention.v_proj",
      "model.vision_tower.transformer.layers.12.attention.q_proj",
      "model.vision_tower.transformer.layers.12.attention.o_proj",
      "model.vision_tower.transformer.layers.13.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.13.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.13.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.13.attention.k_proj",
      "model.vision_tower.transformer.layers.13.attention.v_proj",
      "model.vision_tower.transformer.layers.13.attention.q_proj",
      "model.vision_tower.transformer.layers.13.attention.o_proj",
      "model.vision_tower.transformer.layers.14.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.14.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.14.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.14.attention.k_proj",
      "model.vision_tower.transformer.layers.14.attention.v_proj",
      "model.vision_tower.transformer.layers.14.attention.q_proj",
      "model.vision_tower.transformer.layers.14.attention.o_proj",
      "model.vision_tower.transformer.layers.15.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.15.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.15.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.15.attention.k_proj",
      "model.vision_tower.transformer.layers.15.attention.v_proj",
      "model.vision_tower.transformer.layers.15.attention.q_proj",
      "model.vision_tower.transformer.layers.15.attention.o_proj",
      "model.vision_tower.transformer.layers.16.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.16.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.16.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.16.attention.k_proj",
      "model.vision_tower.transformer.layers.16.attention.v_proj",
      "model.vision_tower.transformer.layers.16.attention.q_proj",
      "model.vision_tower.transformer.layers.16.attention.o_proj",
      "model.vision_tower.transformer.layers.17.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.17.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.17.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.17.attention.k_proj",
      "model.vision_tower.transformer.layers.17.attention.v_proj",
      "model.vision_tower.transformer.layers.17.attention.q_proj",
      "model.vision_tower.transformer.layers.17.attention.o_proj",
      "model.vision_tower.transformer.layers.18.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.18.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.18.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.18.attention.k_proj",
      "model.vision_tower.transformer.layers.18.attention.v_proj",
      "model.vision_tower.transformer.layers.18.attention.q_proj",
      "model.vision_tower.transformer.layers.18.attention.o_proj",
      "model.vision_tower.transformer.layers.19.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.19.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.19.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.19.attention.k_proj",
      "model.vision_tower.transformer.layers.19.attention.v_proj",
      "model.vision_tower.transformer.layers.19.attention.q_proj",
      "model.vision_tower.transformer.layers.19.attention.o_proj",
      "model.vision_tower.transformer.layers.20.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.20.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.20.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.20.attention.k_proj",
      "model.vision_tower.transformer.layers.20.attention.v_proj",
      "model.vision_tower.transformer.layers.20.attention.q_proj",
      "model.vision_tower.transformer.layers.20.attention.o_proj",
      "model.vision_tower.transformer.layers.21.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.21.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.21.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.21.attention.k_proj",
      "model.vision_tower.transformer.layers.21.attention.v_proj",
      "model.vision_tower.transformer.layers.21.attention.q_proj",
      "model.vision_tower.transformer.layers.21.attention.o_proj",
      "model.vision_tower.transformer.layers.22.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.22.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.22.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.22.attention.k_proj",
      "model.vision_tower.transformer.layers.22.attention.v_proj",
      "model.vision_tower.transformer.layers.22.attention.q_proj",
      "model.vision_tower.transformer.layers.22.attention.o_proj",
      "model.vision_tower.transformer.layers.23.feed_forward.gate_proj",
      "model.vision_tower.transformer.layers.23.feed_forward.up_proj",
      "model.vision_tower.transformer.layers.23.feed_forward.down_proj",
      "model.vision_tower.transformer.layers.23.attention.k_proj",
      "model.vision_tower.transformer.layers.23.attention.v_proj",
      "model.vision_tower.transformer.layers.23.attention.q_proj",
      "model.vision_tower.transformer.layers.23.attention.o_proj",
      "model.multi_modal_projector.patch_merger.merging_layer",
      "model.multi_modal_projector.linear_1",
      "model.multi_modal_projector.linear_2",
      "language_model.model.layers.0.self_attn.q_a_proj",
      "language_model.model.layers.0.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.0.mlp.shared_experts.gate_proj",
      "language_model.model.layers.0.mlp.shared_experts.up_proj",
      "language_model.model.layers.0.mlp.shared_experts.down_proj",
      "language_model.model.layers.1.self_attn.q_a_proj",
      "language_model.model.layers.1.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.1.mlp.shared_experts.gate_proj",
      "language_model.model.layers.1.mlp.shared_experts.up_proj",
      "language_model.model.layers.1.mlp.shared_experts.down_proj",
      "language_model.model.layers.2.self_attn.q_a_proj",
      "language_model.model.layers.2.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.2.mlp.shared_experts.gate_proj",
      "language_model.model.layers.2.mlp.shared_experts.up_proj",
      "language_model.model.layers.2.mlp.shared_experts.down_proj",
      "language_model.model.layers.3.self_attn.q_a_proj",
      "language_model.model.layers.3.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.3.mlp.shared_experts.gate_proj",
      "language_model.model.layers.3.mlp.shared_experts.up_proj",
      "language_model.model.layers.3.mlp.shared_experts.down_proj",
      "language_model.model.layers.4.self_attn.q_a_proj",
      "language_model.model.layers.4.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.4.mlp.shared_experts.gate_proj",
      "language_model.model.layers.4.mlp.shared_experts.up_proj",
      "language_model.model.layers.4.mlp.shared_experts.down_proj",
      "language_model.model.layers.5.self_attn.q_a_proj",
      "language_model.model.layers.5.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.5.mlp.shared_experts.gate_proj",
      "language_model.model.layers.5.mlp.shared_experts.up_proj",
      "language_model.model.layers.5.mlp.shared_experts.down_proj",
      "language_model.model.layers.6.self_attn.q_a_proj",
      "language_model.model.layers.6.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.6.mlp.shared_experts.gate_proj",
      "language_model.model.layers.6.mlp.shared_experts.up_proj",
      "language_model.model.layers.6.mlp.shared_experts.down_proj",
      "language_model.model.layers.7.self_attn.q_a_proj",
      "language_model.model.layers.7.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.7.mlp.shared_experts.gate_proj",
      "language_model.model.layers.7.mlp.shared_experts.up_proj",
      "language_model.model.layers.7.mlp.shared_experts.down_proj",
      "language_model.model.layers.8.self_attn.q_a_proj",
      "language_model.model.layers.8.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.8.mlp.shared_experts.gate_proj",
      "language_model.model.layers.8.mlp.shared_experts.up_proj",
      "language_model.model.layers.8.mlp.shared_experts.down_proj",
      "language_model.model.layers.9.self_attn.q_a_proj",
      "language_model.model.layers.9.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.9.mlp.shared_experts.gate_proj",
      "language_model.model.layers.9.mlp.shared_experts.up_proj",
      "language_model.model.layers.9.mlp.shared_experts.down_proj",
      "language_model.model.layers.10.self_attn.q_a_proj",
      "language_model.model.layers.10.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.10.mlp.shared_experts.gate_proj",
      "language_model.model.layers.10.mlp.shared_experts.up_proj",
      "language_model.model.layers.10.mlp.shared_experts.down_proj",
      "language_model.model.layers.11.self_attn.q_a_proj",
      "language_model.model.layers.11.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.11.mlp.shared_experts.gate_proj",
      "language_model.model.layers.11.mlp.shared_experts.up_proj",
      "language_model.model.layers.11.mlp.shared_experts.down_proj",
      "language_model.model.layers.12.self_attn.q_a_proj",
      "language_model.model.layers.12.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.12.mlp.shared_experts.gate_proj",
      "language_model.model.layers.12.mlp.shared_experts.up_proj",
      "language_model.model.layers.12.mlp.shared_experts.down_proj",
      "language_model.model.layers.13.self_attn.q_a_proj",
      "language_model.model.layers.13.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.13.mlp.shared_experts.gate_proj",
      "language_model.model.layers.13.mlp.shared_experts.up_proj",
      "language_model.model.layers.13.mlp.shared_experts.down_proj",
      "language_model.model.layers.14.self_attn.q_a_proj",
      "language_model.model.layers.14.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.14.mlp.shared_experts.gate_proj",
      "language_model.model.layers.14.mlp.shared_experts.up_proj",
      "language_model.model.layers.14.mlp.shared_experts.down_proj",
      "language_model.model.layers.15.self_attn.q_a_proj",
      "language_model.model.layers.15.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.15.mlp.shared_experts.gate_proj",
      "language_model.model.layers.15.mlp.shared_experts.up_proj",
      "language_model.model.layers.15.mlp.shared_experts.down_proj",
      "language_model.model.layers.16.self_attn.q_a_proj",
      "language_model.model.layers.16.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.16.mlp.shared_experts.gate_proj",
      "language_model.model.layers.16.mlp.shared_experts.up_proj",
      "language_model.model.layers.16.mlp.shared_experts.down_proj",
      "language_model.model.layers.17.self_attn.q_a_proj",
      "language_model.model.layers.17.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.17.mlp.shared_experts.gate_proj",
      "language_model.model.layers.17.mlp.shared_experts.up_proj",
      "language_model.model.layers.17.mlp.shared_experts.down_proj",
      "language_model.model.layers.18.self_attn.q_a_proj",
      "language_model.model.layers.18.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.18.mlp.shared_experts.gate_proj",
      "language_model.model.layers.18.mlp.shared_experts.up_proj",
      "language_model.model.layers.18.mlp.shared_experts.down_proj",
      "language_model.model.layers.19.self_attn.q_a_proj",
      "language_model.model.layers.19.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.19.mlp.shared_experts.gate_proj",
      "language_model.model.layers.19.mlp.shared_experts.up_proj",
      "language_model.model.layers.19.mlp.shared_experts.down_proj",
      "language_model.model.layers.20.self_attn.q_a_proj",
      "language_model.model.layers.20.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.20.mlp.shared_experts.gate_proj",
      "language_model.model.layers.20.mlp.shared_experts.up_proj",
      "language_model.model.layers.20.mlp.shared_experts.down_proj",
      "language_model.model.layers.21.self_attn.q_a_proj",
      "language_model.model.layers.21.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.21.mlp.shared_experts.gate_proj",
      "language_model.model.layers.21.mlp.shared_experts.up_proj",
      "language_model.model.layers.21.mlp.shared_experts.down_proj",
      "language_model.model.layers.22.self_attn.q_a_proj",
      "language_model.model.layers.22.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.22.mlp.shared_experts.gate_proj",
      "language_model.model.layers.22.mlp.shared_experts.up_proj",
      "language_model.model.layers.22.mlp.shared_experts.down_proj",
      "language_model.model.layers.23.self_attn.q_a_proj",
      "language_model.model.layers.23.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.23.mlp.shared_experts.gate_proj",
      "language_model.model.layers.23.mlp.shared_experts.up_proj",
      "language_model.model.layers.23.mlp.shared_experts.down_proj",
      "language_model.model.layers.24.self_attn.q_a_proj",
      "language_model.model.layers.24.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.24.mlp.shared_experts.gate_proj",
      "language_model.model.layers.24.mlp.shared_experts.up_proj",
      "language_model.model.layers.24.mlp.shared_experts.down_proj",
      "language_model.model.layers.25.self_attn.q_a_proj",
      "language_model.model.layers.25.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.25.mlp.shared_experts.gate_proj",
      "language_model.model.layers.25.mlp.shared_experts.up_proj",
      "language_model.model.layers.25.mlp.shared_experts.down_proj",
      "language_model.model.layers.26.self_attn.q_a_proj",
      "language_model.model.layers.26.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.26.mlp.shared_experts.gate_proj",
      "language_model.model.layers.26.mlp.shared_experts.up_proj",
      "language_model.model.layers.26.mlp.shared_experts.down_proj",
      "language_model.model.layers.27.self_attn.q_a_proj",
      "language_model.model.layers.27.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.27.mlp.shared_experts.gate_proj",
      "language_model.model.layers.27.mlp.shared_experts.up_proj",
      "language_model.model.layers.27.mlp.shared_experts.down_proj",
      "language_model.model.layers.28.self_attn.q_a_proj",
      "language_model.model.layers.28.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.28.mlp.shared_experts.gate_proj",
      "language_model.model.layers.28.mlp.shared_experts.up_proj",
      "language_model.model.layers.28.mlp.shared_experts.down_proj",
      "language_model.model.layers.29.self_attn.q_a_proj",
      "language_model.model.layers.29.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.29.mlp.shared_experts.gate_proj",
      "language_model.model.layers.29.mlp.shared_experts.up_proj",
      "language_model.model.layers.29.mlp.shared_experts.down_proj",
      "language_model.model.layers.30.self_attn.q_a_proj",
      "language_model.model.layers.30.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.30.mlp.shared_experts.gate_proj",
      "language_model.model.layers.30.mlp.shared_experts.up_proj",
      "language_model.model.layers.30.mlp.shared_experts.down_proj",
      "language_model.model.layers.31.self_attn.q_a_proj",
      "language_model.model.layers.31.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.31.mlp.shared_experts.gate_proj",
      "language_model.model.layers.31.mlp.shared_experts.up_proj",
      "language_model.model.layers.31.mlp.shared_experts.down_proj",
      "language_model.model.layers.32.self_attn.q_a_proj",
      "language_model.model.layers.32.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.32.mlp.shared_experts.gate_proj",
      "language_model.model.layers.32.mlp.shared_experts.up_proj",
      "language_model.model.layers.32.mlp.shared_experts.down_proj",
      "language_model.model.layers.33.self_attn.q_a_proj",
      "language_model.model.layers.33.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.33.mlp.shared_experts.gate_proj",
      "language_model.model.layers.33.mlp.shared_experts.up_proj",
      "language_model.model.layers.33.mlp.shared_experts.down_proj",
      "language_model.model.layers.34.self_attn.q_a_proj",
      "language_model.model.layers.34.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.34.mlp.shared_experts.gate_proj",
      "language_model.model.layers.34.mlp.shared_experts.up_proj",
      "language_model.model.layers.34.mlp.shared_experts.down_proj",
      "language_model.model.layers.35.self_attn.q_a_proj",
      "language_model.model.layers.35.self_attn.kv_a_proj_with_mqa",
      "language_model.model.layers.35.mlp.shared_experts.gate_proj",
      "language_model.model.layers.35.mlp.shared_experts.up_proj",
      "language_model.model.layers.35.mlp.shared_experts.down_proj",
      "model.language_model.layers.0.self_attn.q_a_proj",
      "model.language_model.layers.0.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.0.mlp.shared_experts.gate_proj",
      "model.language_model.layers.0.mlp.shared_experts.up_proj",
      "model.language_model.layers.0.mlp.shared_experts.down_proj",
      "model.language_model.layers.1.self_attn.q_a_proj",
      "model.language_model.layers.1.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.1.mlp.shared_experts.gate_proj",
      "model.language_model.layers.1.mlp.shared_experts.up_proj",
      "model.language_model.layers.1.mlp.shared_experts.down_proj",
      "model.language_model.layers.2.self_attn.q_a_proj",
      "model.language_model.layers.2.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.2.mlp.shared_experts.gate_proj",
      "model.language_model.layers.2.mlp.shared_experts.up_proj",
      "model.language_model.layers.2.mlp.shared_experts.down_proj",
      "model.language_model.layers.3.self_attn.q_a_proj",
      "model.language_model.layers.3.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.3.mlp.shared_experts.gate_proj",
      "model.language_model.layers.3.mlp.shared_experts.up_proj",
      "model.language_model.layers.3.mlp.shared_experts.down_proj",
      "model.language_model.layers.4.self_attn.q_a_proj",
      "model.language_model.layers.4.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.4.mlp.shared_experts.gate_proj",
      "model.language_model.layers.4.mlp.shared_experts.up_proj",
      "model.language_model.layers.4.mlp.shared_experts.down_proj",
      "model.language_model.layers.5.self_attn.q_a_proj",
      "model.language_model.layers.5.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.5.mlp.shared_experts.gate_proj",
      "model.language_model.layers.5.mlp.shared_experts.up_proj",
      "model.language_model.layers.5.mlp.shared_experts.down_proj",
      "model.language_model.layers.6.self_attn.q_a_proj",
      "model.language_model.layers.6.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.6.mlp.shared_experts.gate_proj",
      "model.language_model.layers.6.mlp.shared_experts.up_proj",
      "model.language_model.layers.6.mlp.shared_experts.down_proj",
      "model.language_model.layers.7.self_attn.q_a_proj",
      "model.language_model.layers.7.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.7.mlp.shared_experts.gate_proj",
      "model.language_model.layers.7.mlp.shared_experts.up_proj",
      "model.language_model.layers.7.mlp.shared_experts.down_proj",
      "model.language_model.layers.8.self_attn.q_a_proj",
      "model.language_model.layers.8.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.8.mlp.shared_experts.gate_proj",
      "model.language_model.layers.8.mlp.shared_experts.up_proj",
      "model.language_model.layers.8.mlp.shared_experts.down_proj",
      "model.language_model.layers.9.self_attn.q_a_proj",
      "model.language_model.layers.9.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.9.mlp.shared_experts.gate_proj",
      "model.language_model.layers.9.mlp.shared_experts.up_proj",
      "model.language_model.layers.9.mlp.shared_experts.down_proj",
      "model.language_model.layers.10.self_attn.q_a_proj",
      "model.language_model.layers.10.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.10.mlp.shared_experts.gate_proj",
      "model.language_model.layers.10.mlp.shared_experts.up_proj",
      "model.language_model.layers.10.mlp.shared_experts.down_proj",
      "model.language_model.layers.11.self_attn.q_a_proj",
      "model.language_model.layers.11.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.11.mlp.shared_experts.gate_proj",
      "model.language_model.layers.11.mlp.shared_experts.up_proj",
      "model.language_model.layers.11.mlp.shared_experts.down_proj",
      "model.language_model.layers.12.self_attn.q_a_proj",
      "model.language_model.layers.12.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.12.mlp.shared_experts.gate_proj",
      "model.language_model.layers.12.mlp.shared_experts.up_proj",
      "model.language_model.layers.12.mlp.shared_experts.down_proj",
      "model.language_model.layers.13.self_attn.q_a_proj",
      "model.language_model.layers.13.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.13.mlp.shared_experts.gate_proj",
      "model.language_model.layers.13.mlp.shared_experts.up_proj",
      "model.language_model.layers.13.mlp.shared_experts.down_proj",
      "model.language_model.layers.14.self_attn.q_a_proj",
      "model.language_model.layers.14.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.14.mlp.shared_experts.gate_proj",
      "model.language_model.layers.14.mlp.shared_experts.up_proj",
      "model.language_model.layers.14.mlp.shared_experts.down_proj",
      "model.language_model.layers.15.self_attn.q_a_proj",
      "model.language_model.layers.15.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.15.mlp.shared_experts.gate_proj",
      "model.language_model.layers.15.mlp.shared_experts.up_proj",
      "model.language_model.layers.15.mlp.shared_experts.down_proj",
      "model.language_model.layers.16.self_attn.q_a_proj",
      "model.language_model.layers.16.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.16.mlp.shared_experts.gate_proj",
      "model.language_model.layers.16.mlp.shared_experts.up_proj",
      "model.language_model.layers.16.mlp.shared_experts.down_proj",
      "model.language_model.layers.17.self_attn.q_a_proj",
      "model.language_model.layers.17.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.17.mlp.shared_experts.gate_proj",
      "model.language_model.layers.17.mlp.shared_experts.up_proj",
      "model.language_model.layers.17.mlp.shared_experts.down_proj",
      "model.language_model.layers.18.self_attn.q_a_proj",
      "model.language_model.layers.18.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.18.mlp.shared_experts.gate_proj",
      "model.language_model.layers.18.mlp.shared_experts.up_proj",
      "model.language_model.layers.18.mlp.shared_experts.down_proj",
      "model.language_model.layers.19.self_attn.q_a_proj",
      "model.language_model.layers.19.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.19.mlp.shared_experts.gate_proj",
      "model.language_model.layers.19.mlp.shared_experts.up_proj",
      "model.language_model.layers.19.mlp.shared_experts.down_proj",
      "model.language_model.layers.20.self_attn.q_a_proj",
      "model.language_model.layers.20.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.20.mlp.shared_experts.gate_proj",
      "model.language_model.layers.20.mlp.shared_experts.up_proj",
      "model.language_model.layers.20.mlp.shared_experts.down_proj",
      "model.language_model.layers.21.self_attn.q_a_proj",
      "model.language_model.layers.21.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.21.mlp.shared_experts.gate_proj",
      "model.language_model.layers.21.mlp.shared_experts.up_proj",
      "model.language_model.layers.21.mlp.shared_experts.down_proj",
      "model.language_model.layers.22.self_attn.q_a_proj",
      "model.language_model.layers.22.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.22.mlp.shared_experts.gate_proj",
      "model.language_model.layers.22.mlp.shared_experts.up_proj",
      "model.language_model.layers.22.mlp.shared_experts.down_proj",
      "model.language_model.layers.23.self_attn.q_a_proj",
      "model.language_model.layers.23.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.23.mlp.shared_experts.gate_proj",
      "model.language_model.layers.23.mlp.shared_experts.up_proj",
      "model.language_model.layers.23.mlp.shared_experts.down_proj",
      "model.language_model.layers.24.self_attn.q_a_proj",
      "model.language_model.layers.24.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.24.mlp.shared_experts.gate_proj",
      "model.language_model.layers.24.mlp.shared_experts.up_proj",
      "model.language_model.layers.24.mlp.shared_experts.down_proj",
      "model.language_model.layers.25.self_attn.q_a_proj",
      "model.language_model.layers.25.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.25.mlp.shared_experts.gate_proj",
      "model.language_model.layers.25.mlp.shared_experts.up_proj",
      "model.language_model.layers.25.mlp.shared_experts.down_proj",
      "model.language_model.layers.26.self_attn.q_a_proj",
      "model.language_model.layers.26.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.26.mlp.shared_experts.gate_proj",
      "model.language_model.layers.26.mlp.shared_experts.up_proj",
      "model.language_model.layers.26.mlp.shared_experts.down_proj",
      "model.language_model.layers.27.self_attn.q_a_proj",
      "model.language_model.layers.27.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.27.mlp.shared_experts.gate_proj",
      "model.language_model.layers.27.mlp.shared_experts.up_proj",
      "model.language_model.layers.27.mlp.shared_experts.down_proj",
      "model.language_model.layers.28.self_attn.q_a_proj",
      "model.language_model.layers.28.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.28.mlp.shared_experts.gate_proj",
      "model.language_model.layers.28.mlp.shared_experts.up_proj",
      "model.language_model.layers.28.mlp.shared_experts.down_proj",
      "model.language_model.layers.29.self_attn.q_a_proj",
      "model.language_model.layers.29.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.29.mlp.shared_experts.gate_proj",
      "model.language_model.layers.29.mlp.shared_experts.up_proj",
      "model.language_model.layers.29.mlp.shared_experts.down_proj",
      "model.language_model.layers.30.self_attn.q_a_proj",
      "model.language_model.layers.30.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.30.mlp.shared_experts.gate_proj",
      "model.language_model.layers.30.mlp.shared_experts.up_proj",
      "model.language_model.layers.30.mlp.shared_experts.down_proj",
      "model.language_model.layers.31.self_attn.q_a_proj",
      "model.language_model.layers.31.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.31.mlp.shared_experts.gate_proj",
      "model.language_model.layers.31.mlp.shared_experts.up_proj",
      "model.language_model.layers.31.mlp.shared_experts.down_proj",
      "model.language_model.layers.32.self_attn.q_a_proj",
      "model.language_model.layers.32.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.32.mlp.shared_experts.gate_proj",
      "model.language_model.layers.32.mlp.shared_experts.up_proj",
      "model.language_model.layers.32.mlp.shared_experts.down_proj",
      "model.language_model.layers.33.self_attn.q_a_proj",
      "model.language_model.layers.33.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.33.mlp.shared_experts.gate_proj",
      "model.language_model.layers.33.mlp.shared_experts.up_proj",
      "model.language_model.layers.33.mlp.shared_experts.down_proj",
      "model.language_model.layers.34.self_attn.q_a_proj",
      "model.language_model.layers.34.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.34.mlp.shared_experts.gate_proj",
      "model.language_model.layers.34.mlp.shared_experts.up_proj",
      "model.language_model.layers.34.mlp.shared_experts.down_proj",
      "model.language_model.layers.35.self_attn.q_a_proj",
      "model.language_model.layers.35.self_attn.kv_a_proj_with_mqa",
      "model.language_model.layers.35.mlp.shared_experts.gate_proj",
      "model.language_model.layers.35.mlp.shared_experts.up_proj",
      "model.language_model.layers.35.mlp.shared_experts.down_proj",
      "lm_head"
    ],
    "kv_cache_scheme": null,
    "quant_method": "compressed-tensors",
    "quantization_status": "compressed",
    "sparsity_config": {},
    "transform_config": {},
    "version": "0.14.1.dev19+g70e9990"
  },
  "spatial_merge_size": 2,
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "first_k_dense_replace": 0,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "kv_lora_rank": 256,
    "max_position_embeddings": 1048576,
    "mlp_bias": false,
    "model_type": "mistral4",
    "moe_intermediate_size": 2048,
    "n_group": 1,
    "n_routed_experts": 128,
    "n_shared_experts": 1,
    "norm_topk_prob": true,
    "num_attention_heads": 32,
    "num_experts_per_tok": 4,
    "num_hidden_layers": 36,
    "num_key_value_heads": 32,
    "pad_token_id": 11,
    "pretraining_tp": 1,
    "q_lora_rank": 1024,
    "qk_head_dim": 128,
    "qk_nope_head_dim": 64,
    "qk_rope_head_dim": 64,
    "rms_norm_eps": 1e-06,
    "rope_interleave": true,
    "rope_parameters": {
      "beta_fast": 32.0,
      "beta_slow": 1.0,
      "factor": 128.0,
      "llama_4_scaling_beta": 0.1,
      "mscale": 1.0,
      "mscale_all_dim": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_theta": 10000.0,
      "rope_type": "yarn",
      "type": "yarn"
    },
    "routed_scaling_factor": 1.0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "topk_group": 1,
    "use_cache": true,
    "v_head_dim": 128,
    "vocab_size": 131072
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.3.0.dev0",
  "vision_config": {
    "attention_dropout": 0.0,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "image_size": 1540,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "model_type": "pixtral",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "rope_parameters": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "vision_feature_layer": -1
}
