{
  "architectures": [
    "Mistral3ForConditionalGeneration"
  ],
  "dtype": "bfloat16",
  "eos_token_id": 2,
  "image_token_index": 10,
  "model_type": "mistral3",
  "multimodal_projector_bias": false,
  "projector_hidden_act": "gelu",
  "quantization": {
    "group_size": 64,
    "bits": 4,
    "mode": "affine",
    "language_model.model.layers.0.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.1.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.2.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.3.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.4.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.5.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.6.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.7.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.8.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.9.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.10.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.11.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.12.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.13.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.14.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.15.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.16.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.17.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.18.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.19.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.20.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.21.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.22.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.23.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.24.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.25.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.26.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.27.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.28.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.29.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.30.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.31.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.32.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.33.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.34.mlp.gate": {
      "group_size": 64,
      "bits": 8
    },
    "language_model.model.layers.35.mlp.gate": {
      "group_size": 64,
      "bits": 8
    }
  },
  "quantization_config": {
    "group_size": 64,
    "bits": 2,
    "mode": "affine",
    "language_model.model.layers.0.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.1.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.2.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.3.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.4.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.5.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.6.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.7.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.8.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.9.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.10.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.11.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.12.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.13.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.14.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.15.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.16.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.17.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.18.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.19.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.20.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.21.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.22.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.23.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.24.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.25.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.26.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.27.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.28.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.29.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.30.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.31.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.32.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.33.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.34.mlp.gate": {
      "group_size": 64,
      "bits": 2
    },
    "language_model.model.layers.35.mlp.gate": {
      "group_size": 64,
      "bits": 2
    }
  },
  "spatial_merge_size": 2,
  "text_config": {
    "attention_bias": false,
    "attention_dropout": 0.0,
    "bos_token_id": 1,
    "eos_token_id": 2,
    "first_k_dense_replace": 0,
    "head_dim": 128,
    "hidden_act": "silu",
    "hidden_size": 4096,
    "initializer_range": 0.02,
    "intermediate_size": 12288,
    "kv_lora_rank": 256,
    "max_position_embeddings": 1048576,
    "mlp_bias": false,
    "model_type": "mistral4",
    "moe_intermediate_size": 2048,
    "n_group": 1,
    "n_routed_experts": 128,
    "n_shared_experts": 1,
    "norm_topk_prob": true,
    "num_attention_heads": 32,
    "num_experts_per_tok": 4,
    "num_hidden_layers": 36,
    "num_key_value_heads": 32,
    "pad_token_id": 11,
    "pretraining_tp": 1,
    "q_lora_rank": 1024,
    "qk_head_dim": 128,
    "qk_nope_head_dim": 64,
    "qk_rope_head_dim": 64,
    "rms_norm_eps": 1e-06,
    "rope_interleave": true,
    "rope_parameters": {
      "beta_fast": 32.0,
      "beta_slow": 1.0,
      "factor": 128.0,
      "llama_4_scaling_beta": 0.1,
      "mscale": 1.0,
      "mscale_all_dim": 1.0,
      "original_max_position_embeddings": 8192,
      "rope_theta": 10000.0,
      "rope_type": "yarn",
      "type": "yarn"
    },
    "routed_scaling_factor": 1.0,
    "sliding_window": null,
    "tie_word_embeddings": false,
    "topk_group": 1,
    "use_cache": true,
    "v_head_dim": 128,
    "vocab_size": 131072
  },
  "tie_word_embeddings": false,
  "transformers_version": "5.3.0.dev0",
  "vision_config": {
    "attention_dropout": 0.0,
    "head_dim": 64,
    "hidden_act": "silu",
    "hidden_size": 1024,
    "image_size": 1540,
    "initializer_range": 0.02,
    "intermediate_size": 4096,
    "model_type": "pixtral",
    "num_attention_heads": 16,
    "num_channels": 3,
    "num_hidden_layers": 24,
    "patch_size": 14,
    "rope_parameters": {
      "rope_theta": 10000.0,
      "rope_type": "default"
    }
  },
  "vision_feature_layer": -1
}
