{
    "metadata": {
        "total_size": 66949842944,
        "total_parameters": 118972826624
    },
    "weight_map": {
        "language_model.lm_head.biases": "model-00014-of-00014.safetensors",
        "language_model.lm_head.scales": "model-00014-of-00014.safetensors",
        "language_model.lm_head.weight": "model-00014-of-00014.safetensors",
        "language_model.model.embed_tokens.biases": "model-00001-of-00014.safetensors",
        "language_model.model.embed_tokens.scales": "model-00001-of-00014.safetensors",
        "language_model.model.embed_tokens.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.input_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.gate.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.down_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.down_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.down_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.gate_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.gate_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.gate_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.up_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.up_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.shared_experts.up_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.down_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.down_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.down_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.up_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.up_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.mlp.switch_mlp.up_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.post_attention_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.embed_q.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.embed_q.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.embed_q.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.kv_a_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.kv_a_proj_with_mqa.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.kv_a_proj_with_mqa.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.kv_a_proj_with_mqa.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.o_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.o_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.o_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.q_a_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.q_a_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.q_a_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.q_a_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.q_b_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.q_b_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.q_b_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.unembed_out.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.unembed_out.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.0.self_attn.unembed_out.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.input_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.gate.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.down_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.down_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.down_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.gate_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.gate_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.gate_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.up_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.up_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.shared_experts.up_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.down_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.down_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.down_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.gate_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.gate_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.gate_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.up_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.up_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.mlp.switch_mlp.up_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.post_attention_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.embed_q.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.embed_q.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.embed_q.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.kv_a_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.kv_a_proj_with_mqa.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.kv_a_proj_with_mqa.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.kv_a_proj_with_mqa.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.o_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.o_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.o_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.q_a_layernorm.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.q_a_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.q_a_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.q_a_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.q_b_proj.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.q_b_proj.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.q_b_proj.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.unembed_out.biases": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.unembed_out.scales": "model-00001-of-00014.safetensors",
        "language_model.model.layers.1.self_attn.unembed_out.weight": "model-00001-of-00014.safetensors",
        "language_model.model.layers.10.input_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.gate.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.down_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.down_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.down_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.gate_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.gate_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.gate_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.up_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.up_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.shared_experts.up_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.down_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.down_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.down_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.gate_proj.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.gate_proj.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.gate_proj.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.up_proj.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.up_proj.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.mlp.switch_mlp.up_proj.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.post_attention_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.embed_q.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.embed_q.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.embed_q.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.kv_a_layernorm.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.kv_a_proj_with_mqa.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.kv_a_proj_with_mqa.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.kv_a_proj_with_mqa.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.o_proj.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.o_proj.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.o_proj.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.q_a_layernorm.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.q_a_proj.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.q_a_proj.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.q_a_proj.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.q_b_proj.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.q_b_proj.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.q_b_proj.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.unembed_out.biases": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.unembed_out.scales": "model-00004-of-00014.safetensors",
        "language_model.model.layers.10.self_attn.unembed_out.weight": "model-00004-of-00014.safetensors",
        "language_model.model.layers.11.input_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.gate.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.down_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.down_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.down_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.gate_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.gate_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.gate_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.up_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.up_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.shared_experts.up_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.down_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.down_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.down_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.gate_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.gate_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.gate_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.up_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.up_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.mlp.switch_mlp.up_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.post_attention_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.embed_q.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.embed_q.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.embed_q.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.kv_a_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.kv_a_proj_with_mqa.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.kv_a_proj_with_mqa.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.kv_a_proj_with_mqa.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.o_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.q_a_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.q_a_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.q_a_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.q_a_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.q_b_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.q_b_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.q_b_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.unembed_out.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.unembed_out.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.11.self_attn.unembed_out.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.input_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.gate.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.down_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.down_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.down_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.gate_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.gate_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.gate_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.up_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.up_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.shared_experts.up_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.down_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.down_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.down_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.gate_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.gate_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.gate_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.up_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.up_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.mlp.switch_mlp.up_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.post_attention_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.embed_q.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.embed_q.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.embed_q.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.kv_a_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.kv_a_proj_with_mqa.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.kv_a_proj_with_mqa.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.kv_a_proj_with_mqa.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.o_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.o_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.o_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.q_a_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.q_a_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.q_a_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.q_a_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.q_b_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.q_b_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.q_b_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.unembed_out.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.unembed_out.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.12.self_attn.unembed_out.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.input_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.gate.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.down_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.down_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.down_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.gate_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.gate_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.gate_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.up_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.up_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.shared_experts.up_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.down_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.down_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.down_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.gate_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.gate_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.gate_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.up_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.up_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.mlp.switch_mlp.up_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.post_attention_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.embed_q.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.embed_q.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.embed_q.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.kv_a_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.kv_a_proj_with_mqa.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.kv_a_proj_with_mqa.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.kv_a_proj_with_mqa.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.o_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.o_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.o_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.q_a_layernorm.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.q_a_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.q_a_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.q_a_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.q_b_proj.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.q_b_proj.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.q_b_proj.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.unembed_out.biases": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.unembed_out.scales": "model-00005-of-00014.safetensors",
        "language_model.model.layers.13.self_attn.unembed_out.weight": "model-00005-of-00014.safetensors",
        "language_model.model.layers.14.input_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.gate.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.down_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.down_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.down_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.gate_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.gate_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.gate_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.up_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.up_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.shared_experts.up_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.down_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.down_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.down_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.gate_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.gate_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.gate_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.up_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.up_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.mlp.switch_mlp.up_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.post_attention_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.embed_q.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.embed_q.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.embed_q.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.kv_a_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.kv_a_proj_with_mqa.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.kv_a_proj_with_mqa.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.kv_a_proj_with_mqa.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.o_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.o_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.o_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.q_a_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.q_a_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.q_a_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.q_a_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.q_b_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.q_b_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.q_b_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.unembed_out.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.unembed_out.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.14.self_attn.unembed_out.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.input_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.gate.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.down_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.down_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.down_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.gate_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.gate_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.gate_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.up_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.up_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.shared_experts.up_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.down_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.down_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.down_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.gate_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.gate_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.gate_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.up_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.up_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.mlp.switch_mlp.up_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.post_attention_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.embed_q.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.embed_q.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.embed_q.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.kv_a_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.kv_a_proj_with_mqa.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.kv_a_proj_with_mqa.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.kv_a_proj_with_mqa.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.o_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.q_a_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.q_a_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.q_a_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.q_a_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.q_b_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.q_b_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.q_b_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.unembed_out.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.unembed_out.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.15.self_attn.unembed_out.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.input_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.gate.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.down_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.down_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.down_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.gate_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.gate_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.gate_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.up_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.up_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.shared_experts.up_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.down_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.down_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.down_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.gate_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.gate_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.gate_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.up_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.up_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.mlp.switch_mlp.up_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.post_attention_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.embed_q.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.embed_q.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.embed_q.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.kv_a_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.kv_a_proj_with_mqa.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.kv_a_proj_with_mqa.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.kv_a_proj_with_mqa.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.o_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.o_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.o_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.q_a_layernorm.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.q_a_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.q_a_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.q_a_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.q_b_proj.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.q_b_proj.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.q_b_proj.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.unembed_out.biases": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.unembed_out.scales": "model-00006-of-00014.safetensors",
        "language_model.model.layers.16.self_attn.unembed_out.weight": "model-00006-of-00014.safetensors",
        "language_model.model.layers.17.input_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.gate.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.down_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.down_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.down_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.gate_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.gate_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.gate_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.up_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.up_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.shared_experts.up_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.down_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.down_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.down_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.gate_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.gate_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.gate_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.up_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.up_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.mlp.switch_mlp.up_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.post_attention_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.embed_q.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.embed_q.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.embed_q.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.kv_a_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.kv_a_proj_with_mqa.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.kv_a_proj_with_mqa.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.kv_a_proj_with_mqa.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.o_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.o_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.o_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.q_a_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.q_a_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.q_a_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.q_a_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.q_b_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.q_b_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.q_b_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.unembed_out.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.unembed_out.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.17.self_attn.unembed_out.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.input_layernorm.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.gate.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.down_proj.biases": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.down_proj.scales": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.down_proj.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.gate_proj.biases": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.gate_proj.scales": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.gate_proj.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.up_proj.biases": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.up_proj.scales": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.shared_experts.up_proj.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.down_proj.biases": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.down_proj.scales": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.down_proj.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.gate_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.gate_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.gate_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.up_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.up_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.mlp.switch_mlp.up_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.post_attention_layernorm.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.embed_q.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.embed_q.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.embed_q.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.kv_a_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.kv_a_proj_with_mqa.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.kv_a_proj_with_mqa.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.kv_a_proj_with_mqa.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.o_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.o_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.o_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.q_a_layernorm.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.q_a_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.q_a_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.q_a_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.q_b_proj.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.q_b_proj.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.q_b_proj.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.unembed_out.biases": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.unembed_out.scales": "model-00007-of-00014.safetensors",
        "language_model.model.layers.18.self_attn.unembed_out.weight": "model-00007-of-00014.safetensors",
        "language_model.model.layers.19.input_layernorm.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.19.mlp.gate.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.19.mlp.shared_experts.down_proj.biases": "model-00008-of-00014.safetensors",
        "language_model.model.layers.19.mlp.shared_experts.down_proj.scales": "model-00008-of-00014.safetensors",
        "language_model.model.layers.19.mlp.shared_experts.down_proj.weight": "model-00008-of-00014.safetensors",
        "language_model.model.layers.19.mlp.shared_experts.gate_proj.biases": "model-00008-of-00014.safetensors",
